yandld/rt-thread/bsp/mcx/mcxn9xxbrk_internal/applications/main.c
/*
 * Copyright (c) 2006-2023, RT-Thread Development Team
 * Copyright (c) 2019-2020, Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2019-10-24     Magicoe      first version
 * 2020-01-10     Kevin/Karl   Add PS demo
 * 2020-09-21     supperthomas fix the main.c
 *
 */

#include <rtdevice.h>
//#include "dfs_fs.h"
#include "drv_pin.h"


#define LEDB_PIN        ((3*32)+4)
#define BUTTON_PIN      ((0*32)+29)




#include "fsl_lpuart.h"


void sync_in_cb(void *args)
{
    rt_kprintf("!!sync_in_cb\r\n");
}


int main(void)
{
#if defined(__CC_ARM)
    rt_kprintf("using armcc, version: %d\n", __ARMCC_VERSION);
#elif defined(__clang__)
    rt_kprintf("using armclang, version: %d\n", __ARMCC_VERSION);
#elif defined(__ICCARM__)
    rt_kprintf("using iccarm, version: %d\n", __VER__);
#elif defined(__GNUC__)
    rt_kprintf("using gcc, version: %d.%d\n", __GNUC__, __GNUC_MINOR__);
#endif
    
    SYSCON->CLOCK_CTRL = 0xFFFFFFFF;
    
    rt_kprintf("CoreClock:%d\r\n", CLOCK_GetCoreSysClkFreq());
    rt_kprintf("kCLOCK_FroHf:%d\r\n", CLOCK_GetFreq(kCLOCK_FroHf));
    rt_kprintf("kCLOCK_Clk144M:%d\r\n", CLOCK_GetFreq(kCLOCK_Clk144M));
    rt_kprintf("kCLOCK_ExtClk:%d\r\n", CLOCK_GetFreq(kCLOCK_ExtClk));
    
    
    
    rt_kprintf("FLCOMM0:%d\r\n", CLOCK_GetLPFlexCommClkFreq(0));
    rt_kprintf("FLCOMM1:%d\r\n", CLOCK_GetLPFlexCommClkFreq(1));
    rt_kprintf("FLCOMM2:%d\r\n", CLOCK_GetLPFlexCommClkFreq(2));
    rt_kprintf("FLCOMM3:%d\r\n", CLOCK_GetLPFlexCommClkFreq(3));
    rt_kprintf("FLCOMM4:%d\r\n", CLOCK_GetLPFlexCommClkFreq(4));
    rt_kprintf("FLCOMM5:%d\r\n", CLOCK_GetLPFlexCommClkFreq(5));
    
    
    rt_pin_mode(LEDB_PIN, PIN_MODE_OUTPUT);  /* Set GPIO as Output */
    rt_pin_mode(BUTTON_PIN, PIN_MODE_INPUT_PULLUP); 
    
    void sync_in_cb(void *args);
    rt_pin_attach_irq(BUTTON_PIN, PIN_IRQ_MODE_FALLING, sync_in_cb, RT_NULL);
    rt_pin_irq_enable(BUTTON_PIN, 1);
    
#ifdef RT_USING_SDIO
    rt_thread_mdelay(2000);
    if (dfs_mount("sd", "/", "elm", 0, NULL) == 0)
    {
        rt_kprintf("sd mounted to /\n");
    }
    else
    {
        rt_kprintf("sd mount to / failed\n");
    }
#endif

    while (1)
    {
        
        rt_pin_write(LEDB_PIN, PIN_HIGH);    /* Set GPIO output 1 */
        rt_thread_mdelay(200);               /* Delay 500mS */
        rt_pin_write(LEDB_PIN, PIN_LOW);     /* Set GPIO output 0 */
        rt_thread_mdelay(200);               /* Delay 500mS */
        

    }
}

// end file


void NMI_Handler(void)
{
    rt_kprintf("NMI_Handler\r\n");
}

